import os
from flask import Flask, send_file, jsonify

app = Flask(__name__)

@app.route("/")
def index():
    return send_file('src/calendar.html')

@app.route("/calendar")
def calendar():
    return send_file('src/calendar.html')

@app.route("/calendar-data")
def calendar_data():
    data = [
        {
            "month": "Декември 2025",
            "days": {
                "20": [{"name": "Пост", "type": "orthodox", "description": "Време за въздържание от определени храни и напитки, както и за смирение и покаяние."}],
                "21": [{"name": "Пост", "type": "orthodox", "description": "Време за въздържание от определени храни и напитки, както и за смирение и покаяние."}],
                "22": [{"name": "Пост", "type": "orthodox", "description": "Време за въздържание от определени храни и напитки, както и за смирение и покаяние."}],
                "23": [{"name": "Пост", "type": "orthodox", "description": "Време за въздържание от определени храни и напитки, както и за смирение и покаяние."}],
                "24": [{"name": "Бъдни вечер", "type": "orthodox", "description": "На този ден православната църква отбелязва навечерието на Рождество Христово. Традиционно се приготвя постна вечеря с нечетен брой ястия."}, {"name": "Строг пост", "type": "orthodox", "description": "Пълно въздържание от храна и вода за определен период от време."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "25": [{"name": "Рождество Христово", "type": "orthodox", "description": "Един от най-големите християнски празници, на който се чества рождението на Исус Христос."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "26": [{"name": "Събор на Пресвета Богородица", "type": "orthodox", "description": "На втория ден от Рождество Христово, православната църква прославя Света Богородица."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}]
            }
        },
        {
            "month": "Януари 2026",
            "days": {
                "1": [{"name": "Обрезание Господне", "type": "orthodox", "description": "На осмия ден след рождението си, Исус е обрязан съгласно старозаветния закон."}, {"name": "Св. Василий Велики", "type": "orthodox", "description": "Един от тримата светители, велик богослов и църковен отец."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "5": [{"name": "Зимен Кръстовден", "type": "orthodox", "description": "Строг пост в навечерието на Богоявление."}, {"name": "Строг пост", "type": "orthodox", "description": "Пълно въздържание от храна и вода за определен период от време."}],
                "6": [{"name": "Богоявление", "type": "orthodox", "description": "Празник, на който се чества кръщението на Исус Христос в река Йордан. Извършва се ритуал по хвърляне на кръста във вода."}]
            }
        },
        { "month": "Февруари 2026", "days": {} },
        {
            "month": "Март 2026",
            "days": {
                "1": [{"name": "Неделя Сиропустна (Прошка)", "type": "orthodox", "description": "Последният ден преди началото на Великия пост. Искаме и даваме прошка."}],
                "3": [{"name": "Освобождение на България от османско иго", "type": "secular", "description": "Национален празник на България, на който се чества подписването на Санстефанския мирен договор."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}]
            }
        },
        {
            "month": "Април 2026",
            "days": {
                "19": [{"name": "Цветница", "type": "orthodox", "description": "Подвижен празник, който се празнува в неделята преди Великден. Отбелязва тържественото влизане на Исус Христос в Йерусалим."}],
                "26": [{"name": "ВЕЛИКДЕН", "type": "orthodox", "description": "Най-големият празник в православния календар. Чества се възкресението на Исус Христос."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}]
            }
        },
        {
            "month": "Май 2026",
            "days": {
                "1": [{"name": "Ден на труда", "type": "secular", "description": "Международен ден на труда и на работническата солидарност."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "6": [{"name": "Гергьовден, Ден на храбростта и Българската армия", "type": "secular", "description": "Един от най-големите пролетни празници, посветен на Свети Георги Победоносец. Официален празник на Българската армия."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "24": [{"name": "Ден на светите братя Кирил и Методий, на българската азбука, просвета и култура и на славянската книжовност", "type": "secular", "description": "Празник на славянската писменост и култура. Чества се делото на светите братя Кирил и Методий."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}]
            }
        },
        {
            "month": "Юни 2026",
            "days": {
                "4": [{"name": "Възнесение Господне (Спасовден)", "type": "orthodox", "description": "Подвижен празник, който се празнува 40 дни след Великден. Отбелязва възнесението на Исус Христос на небето."}],
                "14": [{"name": "Петдесетница", "type": "orthodox", "description": "Празнува се на 50-ия ден след Великден. На този ден Светият Дух слиза над апостолите."}]
            }
        },
        { "month": "Юли 2026", "days": {} },
        {
            "month": "Август 2026",
            "days": {
                "15": [{"name": "Успение Богородично", "type": "orthodox", "description": "Един от 12-те големи християнски празници, посветен на смъртта (успението) на Божията майка."}]
            }
        },
        {
            "month": "Септември 2026",
            "days": {
                "6": [{"name": "Съединението на България", "type": "secular", "description": "Денят, в който се чества обединението на Княжество България и Източна Румелия през 1885 г."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "22": [{"name": "Ден на независимостта на България", "type": "secular", "description": "Чества се обявяването на независимостта на България на 22 септември 1908 г."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}]
            }
        },
        { "month": "Октомври 2026", "days": {} },
        {
            "month": "Ноември 2026",
            "days": {
                "1": [{"name": "Ден на народните будители", "type": "secular", "description": "Празник, посветен на делото на българските просветители, книжовници и революционери."}]
            }
        },
        {
            "month": "Декември 2026",
            "days": {
                "24": [{"name": "Бъдни вечер", "type": "orthodox", "description": "На този ден православната църква отбелязва навечерието на Рождество Христово. Традиционно се приготвя постна вечеря с нечетен брой ястия."}, {"name": "Строг пост", "type": "orthodox", "description": "Пълно въздържание от храна и вода за определен период от време."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "25": [{"name": "Рождество Христово", "type": "orthodox", "description": "Един от най-големите християнски празници, на който се чества рождението на Исус Христос."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "26": [{"name": "Събор на Пресвета Богородица", "type": "orthodox", "description": "На втория ден от Рождество Христово, православната църква прославя Света Богородица."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}]
            }
        },
        {
            "month": "Януари 2027",
            "days": {
                "1": [{"name": "Обрезание Господне", "type": "orthodox", "description": "На осмия ден след рождението си, Исус е обрязан съгласно старозаветния закон."}, {"name": "Св. Василий Велики", "type": "orthodox", "description": "Един от тримата светители, велик богослов и църковен отец."}, {"name": "Неработен ден", "type": "non-working", "description": "Официален почивен ден."}],
                "6": [{"name": "Богоявление", "type": "orthodox", "description": "Празник, на който се чества кръщението на Исус Христос в река Йордан. Извършва се ритуал по хвърляне на кръста във вода."}]
            }
        }
    ]
    return jsonify(data)

def main():
    app.run(port=int(os.environ.get('PORT', 80)))

if __name__ == "__main__":
    main()
